In [1]:
import pandas as pd

TXT_AVALIABLE = True

In [2]:
if TXT_AVALIABLE:
    # Read the files into DataFrames
    avg_states = pd.read_fwf('avg_states.txt', dtype=str, header=None)
    min_states = pd.read_fwf('min_states.txt', dtype=str, header=None)
    max_states = pd.read_fwf('max_states.txt', dtype=str, header=None)

    print(avg_states.head())
    print(avg_states.tail())
    
    map = {
		0: "code",
		1: "Jan",
		2: "Feb",
		3: "Mar",
		4: "Apr",
		5: "May",
		6: "Jun",
		7: "Jul",
		8: "Aug",
		9: "Sep",
		10: "Oct",
		11: "Nov",
		12: "Dec"
	}

    # Display the DataFrames
    avg_states = avg_states.rename(columns=map)
    min_states = min_states.rename(columns=map)
    max_states = max_states.rename(columns=map)

    avg_states.to_csv('avg_states.csv', index=False)
    min_states.to_csv('min_states.csv', index=False)
    max_states.to_csv('max_states.csv', index=False)

           0      1      2      3      4      5      6      7      8      9   \
0  0010021895  43.10  37.40  54.50  63.40  69.50  77.50  79.20  79.50  77.80
1  0010021896  43.50  47.70  52.50  68.00  75.90  77.40  81.20  82.20  75.90
2  0010021897  41.80  51.10  60.20  62.40  69.00  81.20  81.50  78.80  75.60
3  0010021898  49.00  46.10  59.20  58.80  74.10  80.40  80.00  78.80  75.20
4  0010021899  43.80  40.00  55.60  61.70  76.10  79.90  80.40  80.90  72.80

      10     11     12
0  59.70  53.20  44.90
1  63.20  57.30  46.40
2  67.10  54.20  47.40
3  61.00  49.80  43.40
4  66.00  55.30  44.70
               0      1      2      3      4      5      6      7      8   \
12609  3650022020  47.60  48.10  58.30  61.00  69.90  77.60  82.40  81.10
12610  3650022021  44.80  42.60  56.00  60.80  68.80  78.20  80.30  80.40
12611  3650022022  43.00  45.80  55.00  62.50  72.40  79.60  83.30  80.40
12612  3650022023  48.10  50.30  54.80  61.60  69.90  76.50  82.80  82.60
12613  3650022024  42.10  51.60  56.10  63.50  72.60  80.00  82.20  81.80

          9      10     11     12
12609  73.80  64.50  56.70  45.50
12610  75.20  66.00  53.30  53.60
12611  75.40  63.20  51.90  46.30
12612  75.90  65.40  54.00  48.90
12613  75.40  68.00  57.30  99.90

In [3]:
# Parse the 'code' column to create 'country_code' and 'year' columns
min_states['year'] = min_states['code'].str[-4:]
min_states['code'] = min_states['code'].str[:3]

# Reorder columns to put 'year' as the second column
cols = min_states.columns.tolist()
cols.insert(1, cols.pop(cols.index('year')))
min_states = min_states[cols]

min_states = min_states[(min_states['code'].astype(int) <= 50) | (
    min_states['code'].astype(int) == 110)]  # keep only the states and "National"

min_states = min_states[min_states['year'].astype(int) != 2024]  # remove the year 2024

In [4]:
# Parse the 'code' column to create 'country_code' and 'year' columns
max_states['year'] = max_states['code'].str[-4:]
max_states['code'] = max_states['code'].str[:3]

# Reorder columns to put 'year' as the second column
cols = max_states.columns.tolist()
cols.insert(1, cols.pop(cols.index('year')))
max_states = max_states[cols]

max_states = max_states[(max_states['code'].astype(int) <= 50) | (
    max_states['code'].astype(int) == 110)]

max_states = max_states[max_states['year'].astype(int) != 2024]

In [5]:
# Parse the 'code' column to create 'country_code' and 'year' columns
avg_states['year'] = avg_states['code'].str[-4:]
avg_states['code'] = avg_states['code'].str[:3]

# Reorder columns to put 'year' as the second column
cols = avg_states.columns.tolist()
cols.insert(1, cols.pop(cols.index('year')))
avg_states = avg_states[cols]

avg_states = avg_states[(avg_states['code'].astype(int) <= 50) | (
    avg_states['code'].astype(int) == 110)]

avg_states = avg_states[avg_states['year'].astype(int) != 2024]

# Merge with state codes

In [6]:
# Read the state codes into a DataFrame
state_codes = pd.read_csv('state_codes.csv', dtype=str)

# Merge the state codes with avg_states, min_states, and max_states
avg_states = avg_states.merge(state_codes, on='code', how='left')
min_states = min_states.merge(state_codes, on='code', how='left')
max_states = max_states.merge(state_codes, on='code', how='left')

# Reorder columns
cols = avg_states.columns.tolist()
cols.insert(1, cols.pop(cols.index('country')))
avg_states = avg_states[cols]
min_states = min_states[cols]
max_states = max_states[cols]


avg_states.head()

,code,country,year,Jan,Feb,Mar,Apr,May,Jun,Jul,Aug,Sep,Oct,Nov,Dec
0,001,Alabama,1895,43.10,37.40,54.50,63.40,69.50,77.50,79.20,79.50,77.80,59.70,53.20,44.90
1,001,Alabama,1896,43.50,47.70,52.50,68.00,75.90,77.40,81.20,82.20,75.90,63.20,57.30,46.40
2,001,Alabama,1897,41.80,51.10,60.20,62.40,69.00,81.20,81.50,78.80,75.60,67.10,54.20,47.40
3,001,Alabama,1898,49.00,46.10,59.20,58.80,74.10,80.40,80.00,78.80,75.20,61.00,49.80,43.40
4,001,Alabama,1899,43.80,40.00,55.60,61.70,76.10,79.90,80.40,80.90,72.80,66.00,55.30,44.70

## Final dataset

We want to go from 

|code|country|year|jan|feb|mar|apr|may|jun|...
|-|-|-|-|-|-|-|-|-|-|

To

|code|country|year|month|min|max|avg|
|-|-|-|-|-|-|-|

In [7]:
min_melt = pd.melt(min_states, id_vars=[
                   "code", "country", "year"], var_name="month", value_name="min")
max_melt = pd.melt(max_states, id_vars=[
                   "code", "country", "year"], var_name="month", value_name="max")
avg_melt = pd.melt(avg_states, id_vars=[
                   "code", "country", "year"], var_name="month", value_name="avg")

In [8]:
print(f"min_states before melt:")
min_states.head()

min_states before melt:

,code,country,year,Jan,Feb,Mar,Apr,May,Jun,Jul,Aug,Sep,Oct,Nov,Dec
0,001,Alabama,1895,33.40,26.80,42.40,51.20,58.40,66.50,68.80,69.30,66.40,45.20,41.40,32.70
1,001,Alabama,1896,34.00,36.40,41.20,55.60,63.90,66.90,70.70,70.40,62.60,50.60,45.80,35.10
2,001,Alabama,1897,31.40,41.20,50.40,50.10,55.90,68.30,70.20,68.10,62.50,53.10,41.40,36.90
3,001,Alabama,1898,38.80,34.20,48.50,46.40,60.20,68.00,69.60,69.20,65.10,49.60,38.70,32.50
4,001,Alabama,1899,33.10,28.60,43.50,50.80,63.60,67.60,68.90,69.90,59.40,54.00,42.80,33.80

In [9]:
print(f"min_states after melt:")
min_melt.head()

min_states after melt:

  code  country  year month    min
0  001  Alabama  1895   Jan  33.40
1  001  Alabama  1896   Jan  34.00
2  001  Alabama  1897   Jan  31.40
3  001  Alabama  1898   Jan  38.80
4  001  Alabama  1899   Jan  33.10

In [10]:
final_df = min_melt.merge(max_melt, on=["code", "country", "year", "month"]) \
    .merge(avg_melt, on=["code", "country", "year", "month"])

final_df.head()

  code  country  year month    min    max    avg
0  001  Alabama  1895   Jan  33.40  52.70  43.10
1  001  Alabama  1896   Jan  34.00  53.00  43.50
2  001  Alabama  1897   Jan  31.40  52.10  41.80
3  001  Alabama  1898   Jan  38.80  59.10  49.00
4  001  Alabama  1899   Jan  33.10  54.40  43.80

In [11]:
avg_states.to_csv('avg_states_final.csv', index=False)
min_states.to_csv('min_states_final.csv', index=False)
max_states.to_csv('max_states_final.csv', index=False)

In [12]:
final_df.to_csv("min_max_avg_states.csv", index=False)

# In some rows min is greater than max!!!!

In [33]:
to_swap_min_max = final_df[final_df['min'].astype(float) >= final_df['max'].astype(float)]

      code    country  year month    min    max    avg
2580   021  Minnesota  1895   Jan  11.20  10.00  -0.60
2592   021  Minnesota  1907   Jan  11.30   9.70  -0.80
2597   021  Minnesota  1912   Jan  19.80   1.00  -9.40
2602   021  Minnesota  1917   Jan  11.50  11.30  -0.10
2603   021  Minnesota  1918   Jan  11.80   7.20  -2.30
...    ...        ...   ...   ...    ...    ...    ...
77237  050     Alaska  1954   Dec  14.00  -0.40  -7.30
77239  050     Alaska  1956   Dec  13.80  -1.70  -7.70
77244  050     Alaska  1961   Dec  14.00  -1.80  -7.90
77247  050     Alaska  1964   Dec  16.00  -1.70  -8.90
77263  050     Alaska  1980   Dec  13.60  -1.40  -7.50

[126 rows x 7 columns]

# In some rows avg is greater than max!!!! (probably because of the previous issue)

In [34]:
final_df[final_df['avg'].astype(float) >= final_df['max'].astype(float)]

      code       country  year month    min    max    avg
4054   032  North Dakota  1950   Jan  21.00  -2.80  11.90
6225   050        Alaska  1925   Jan  18.30  -3.50  10.90
6234   050        Alaska  1934   Jan  19.40  -4.70  12.10
6271   050        Alaska  1971   Jan  19.60  -4.00  11.80
6289   050        Alaska  1989   Jan  18.80  -5.00  11.90
6312   050        Alaska  2012   Jan  20.20  -5.40  12.80
10493  032  North Dakota  1936   Feb  23.40  -4.70  14.10
12743  050        Alaska  1990   Feb  20.60  -2.20  11.40
38975  002       Arizona  2023   Jul  69.70  01.00  85.40
40401  014        Kansas  1901   Jul  68.70  00.00  84.40
40434  014        Kansas  1934   Jul  71.30  02.20  86.80
40436  014        Kansas  1936   Jul  69.60  00.50  85.00
40480  014        Kansas  1980   Jul  70.20  00.80  85.50
41595  023      Missouri  1934   Jul  71.00  00.30  85.70
42981  034      Oklahoma  1901   Jul  71.60  00.70  86.10
43014  034      Oklahoma  1934   Jul  73.10  02.30  87.70
43016  034      Oklahoma  1936   Jul  71.90  00.20  86.00
43034  034      Oklahoma  1954   Jul  73.80  02.40  88.10
43060  034      Oklahoma  1980   Jul  72.80  02.00  87.40
43091  034      Oklahoma  2011   Jul  75.40  02.90  89.20
43102  034      Oklahoma  2022   Jul  72.80  00.30  86.60
43661  039  South Dakota  1936   Jul  66.20  00.50  83.30
44005  041         Texas  2022   Jul  74.30  00.00  87.20
49469  034      Oklahoma  1936   Aug  72.40  02.20  87.40
49476  034      Oklahoma  1943   Aug  72.30  00.60  86.40
49544  034      Oklahoma  2011   Aug  73.80  01.60  87.70
50447  041         Texas  2011   Aug  74.70  01.60  88.20
50459  041         Texas  2023   Aug  73.90  01.10  87.50